#include "MQ135.h" // Подключаем библиотеку MQ135 для работы с датчиком газа
int soilMoistureValue = 0; // Переменная для хранения значения влажности почвы
int percentage = 0; // Переменная для хранения процента влажности
#define ANALOGPIN A1 // Задаем пин для подключения аналогового сигнального пина
#define RZERO 206.85 // Указываем значение нулевого сопротивления для датчика MQ135
MQ135 gasSensor = MQ135(ANALOGPIN); // Создаем экземпляр объекта gasSensor для работы с датчиком MQ135
boolean noGas; // Переменная для хранения информации о наличии газа
int gasValue = 0; // Переменная для хранения количества газа
void setup() // Начало настройки
{
  pinMode(3, OUTPUT); // Устанавливаем пин 3 в режим OUTPUT (выход)
  float rzero = gasSensor.getRZero(); // Получаем значение нулевого сопротивления для датчика MQ135
  Serial.begin(9600); // Инициализируем последовательную связь с компьютером на скорости 9600 бит/с
}
void loop() // Начало основного цикла программы
{
  soilMoistureValue = analogRead(A0); // Считываем значение влажности почвы с аналогового пина A0
  float ppm = gasSensor.getPPM(); // Получаем значение концентрации газа (CO2) в ppm (parts per million)
  Serial.println(percentage); // Выводим значение процента влажности на монитор последовательного порта
  Serial.print("CO2 ppm value : "); // Выводим текст "CO2 ppm value : "
  Serial.println(ppm); // Выводим значение концентрации CO2 в ppm
  delay(2000); // Задержка 2 секунды
}