#include <Wire.h> // Подключаем библиотеку Wire для работы с I2C 
#include <LiquidCrystal_I2C.h> // Подключаем библиотеку LiquidCrystal_I2C для работы с LCD по I2C 
#include "DHT.h" // Подключаем библиотеку DHT для работы с датчиком DHT 
 
#define DHTPIN A0 // Задаем пин для подключения сигнального вывода датчика 
#define DHTTYPE DHT11 // Указываем тип используемого датчика (DHT11) 
 
DHT dht(DHTPIN, DHTTYPE); // Создаем экземпляр объекта dht для работы с датчиком 
 
byte degree[8] = // Создаем массив байт для кодирования символа градуса 
{ 
B00111, 
B00101, 
B00111, 
B00000, 
B00000, 
B00000, 
B00000, 
}; 
 
LiquidCrystal_I2C lcd(0x27, 16, 2); // Создаем экземпляр объекта lcd для работы с LCD по I2C, указываем адрес и размерность дисплея 
 
void setup() 
{ 
lcd.init(); // Инициализируем LCD 
lcd.backlight(); // Включаем подсветку LCD 
lcd.createChar(1, degree); // Создаем символ градуса с номером 1 
Serial.begin(9600); // Инициализируем последовательный порт с Baud rate 9600 
dht.begin(); // Инициализируем датчик DHT 
} 
 
void loop() 
{ 
delay(2000); // Добавляем задержку в 2 секунды между измерениями 
 
float h = dht.readHumidity(); // Считываем значение влажности 
float t = dht.readTemperature(); // Считываем значение температуры в градусах Цельсия 
 
lcd.setCursor(0, 0); // Устанавливаем курсор в начало первой строки LCD 
lcd.print("Hum = % "); // Выводим текст "Hum = % " 
lcd.setCursor(7, 0); // Устанавливаем курсор на 7 символ первой строки LCD 
lcd.print(h, 1); // Выводим значение влажности 
 
lcd.setCursor(0, 1); // Устанавливаем курсор в начало второй строки LCD 
lcd.print("Temp = \1C "); // Выводим текст "Temp = °C", \1 - символ градуса 
lcd.setCursor(7, 1); // Устанавливаем курсор на 7 символ второй строки LCD 
lcd.print(t, 1); // Выводим значение температуры 
 
// Здесь также можно добавить вывод значения температуры в градусах Фаренгейта, используя переменную f 
 
// Ожидаем 2 секунды перед следующим измерением 
delay(2000); 
}